# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip, mask = input("Введите IP-сети в формате: 10.1.1.0/24 : ").split('/')
m = str('1'*int(mask)+'0'*(32-int(mask)))
print("Network:\n{0:<8} {1:<8} {2:<8} {3:<8}\n{0:08b} {1:08b} {2:08b} {3:08b}\n".format(
    int(ip.split('.')[0]), int(ip.split('.')[1]), int(ip.split('.')[2]), int(ip.split('.')[3])),
    "Mask:\n/{:}\n{:<8} {:<8} {:<8} {:<8}\n{:<08} {:<08} {:<08} {:<08}".format(
        mask, int(m[0:8], 2), int(m[8:16], 2), int(m[16:24], 2), int(m[24:32], 2),
        int(m[0:8]), int(m[8:16]), int(m[16:24]), int(m[24:32])))

